Revit 2027 API
CoordinationModelLinkUtils.GetColorOverride Method
 Gets the color override value for the provided Coordination Model type.
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static Color GetColorOverride(
	Document document,
	View view,
	Element coordinationModelType
)
Public Shared Function GetColorOverride (
	document As Document,
	view As View,
	coordinationModelType As Element
) As Color
public:
static Color^ GetColorOverride(
	Document^ document,
	View^ view,
	Element^ coordinationModelType
)
static member GetColorOverride :
        document : Document *
        view : View *
        coordinationModelType : Element -> Color
Parameters
document Document
 The document.
view View
 The view.
coordinationModelType Element
 The Coordination Model type element.
Return Value
Color
 Returns the color override value of the Coordination Model type. InvalidColorValue means no override is set.
Exceptions
Exception | Condition
ArgumentException |  document is not a project document. -or- The element coordinationModelType was not found in the given document. -or- The provided element is not a Coordination Model type.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements).
Remarks
 By default, the color setting has no override and its value is InvalidColorValue.
See Also
Reference
CoordinationModelLinkUtils Class
Autodesk.Revit.DB.ExternalData Namespace